import React, {useState} from 'react';
import {Routes, Route, BrowserRouter} from "react-router-dom";
//import text from "./assets/data/data1.json";

const text = [
  "Веб-сайт створили студенти групи...",
  "КН-41!",
  "А точніше, 3-підгрупи:",
  "Синкулич Юрій",
  "Сивокінь Артур",
  "Бич Іван",
  "Кіш Давід",
  "Любка Олександр",
  "Бабінець Руслан",
  "Не натискати!",
  "Гей, я ж просив!",
  "Ти читати вмієш?",
  "Тоді навіщо тиснеш?!",
  "Чуєш?",
  "АУ?!",
  "-_-",
  "Хватить уже!!!",
  "Ну, серйозно!",
  "Ти хто взагалі?",
  "Хоча можеш не відповідати, я і так знаю...",
  "Я знаю хто ти!!",
  "Ти мені подобаєшся :)",
  "Знаєш чому?",
  "Знаєш?",
  "Тому що ти красивий!",
  "Шуткую :)",
  "Тому що ДОСИТЬ КЛАЦАТИ!!!",
  "...",
  "....",
  ".....",
  "Так",
  "Взагалі я можу тебе заставити натискати кнопку 20 раз",
  "Хочешь це?",
  "Останній шанс",
  "20",
  "19",
  "18",
  "17",
  "16",
  "15",
  "14",
  "13",
  "12",
  "11",
  "10",
  "9",
  "8",
  "7",
  "6",
  "5",
  "4",
  "3",
  "2",
  "1",
  "ХАХ",
  "Лузер",
  "Потратив свій час",
  "Щоб натиснути 20 раз",
  "Я тебе ненавиджу",
  "Дуже-дуже сильно!",
  "Коли ти натиснеш, я тебе уб'ю!",
  "Ну давай!!! Що, страшно???",
  "Гаразд, я пожартував",
  "але все одно достатньо",
  "Ти ще тут?",
  "Давай укладем угоду",
  "Я загадаю тобі загадку",
  "Якщо ти відгадаєш, то йди нафіг",
  "Але, якщо не відгадаєш...",
  "То Я йду нафіг",
  "Іде?",
  "Добре, загадка",
  "Зимою і літом...",
  "ХА)",
  "Думаєш, я тупий?)",
  "Хто встиг, той і з'їв, хто це?",
  "Не жми, а відповідай",
  "Знову неправильно",
  "Неправильно",
  "Неправильно",
  "Неправильно",
  "Остання спроба ",
  "Все, я виграв",
  "Я йду нафіг.",
  "Пока!!!",
  "І тут він реально пішов нафіг",
  "Хочешь знову розпочати гру?"
];

function App() {

  const [counter, setCounter] = useState(0);

  const click = () => {
    if (counter === text.length) setCounter(0);
    setCounter(prevState => prevState + 1);
  }

  return (

  <BrowserRouter basename="/college-task/">
    <Routes>
      <Route path="/" element={
        <div className="app-container">
          <div className="text">
            {text[counter]}
          </div>
          <div className="button" onClick={click}>
            <a />
          </div>
        </div>
      } />
    </Routes>
  </BrowserRouter>
  );
}

export default App;
